# Tabela dinâmica (Tratamento carteira de ações)
 
 
 __Nos permite remodelar a tabela de acordo com a necessidade vigente__
 
 * pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)

In [5]:
import pandas as pd
import numpy as np

In [6]:
file = 'acoes_ficticias.csv'
df = pd.read_csv(file,delimiter=';') # delimiter muda o padrão dos separadores ( em pandas o padrão é a virgula)
df

    Papel  preco_compra  Quantidade
0   PETR4     92.114785         100
1   VVAR3     17.519059         100
2   ITSA4     56.375177         200
3   ITSA4     62.284332         300
4   EMBR3     80.626768         100
5   ITSA4     77.354576         300
6   PETR4      7.330583         100
7   PETR4     37.425152         200
8   EMBR3     62.691443         300
9   VVAR3     58.069377         100
10  VVAR3     18.877459         300
11  PETR4     84.616718         100
12  PETR4     26.778080         200
13  PETR4     12.494286         300
14  ITSA4     82.849075         100
15  EMBR3     32.090326         300
16  PETR4     86.766959         100
17  EMBR3     66.707810         200
18  VVAR3     31.385241         300

In [16]:
df.head()

   Papel  preco_compra  Quantidade
0  PETR4     92.114785         100
1  VVAR3     17.519059         100
2  ITSA4     56.375177         200
3  ITSA4     62.284332         300
4  EMBR3     80.626768         100

In [17]:
df.columns

Index(['Papel', 'preco_compra', 'Quantidade'], dtype='object')

In [20]:
#Agrupando todos os papeis do mesmo grupo e somando suas quantidades
# aggfunc = '' default mean
pd.pivot_table(df,index='Papel',values='Quantidade',aggfunc='sum')

       Quantidade
Papel
EMBR3         900
ITSA4         900
PETR4        1100
VVAR3         800

In [7]:
# Adicionando uma nova coluna no data frame

df['valor_total'] = df.preco_compra*df.Quantidade

df.head(5)

   Papel  preco_compra  Quantidade   valor_total
0  PETR4     92.114785         100   9211.478515
1  VVAR3     17.519059         100   1751.905894
2  ITSA4     56.375177         200  11275.035362
3  ITSA4     62.284332         300  18685.299477
4  EMBR3     80.626768         100   8062.676817

In [27]:
soma_qtd_valor = pd.pivot_table(df,index='Papel', values=['Quantidade','valor_total'], aggfunc='sum')

soma_qtd_valor

       Quantidade   valor_total
Papel
EMBR3         900  49838.769433
ITSA4         900  61451.615028
PETR4        1100  43671.836644
VVAR3         800  22637.653709

In [32]:
soma_qtd_valor['pmedio'] = soma_qtd_valor.valor_total/soma_qtd_valor.Quantidade
soma_qtd_valor

       Quantidade   valor_total     pmédio     pmedio
Papel
EMBR3         900  49838.769433  55.376410  55.376410
ITSA4         900  61451.615028  68.279572  68.279572
PETR4        1100  43671.836644  39.701670  39.701670
VVAR3         800  22637.653709  28.297067  28.297067

In [8]:
pd.pivot_table(df,columns='Papel', values='Quantidade',aggfunc='sum')

Papel       EMBR3  ITSA4  PETR4  VVAR3
Quantidade    900    900   1100    800